src/cf/Documents/УведомлениеОПланируемомИмпортеЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>УведомлениеОПланируемомИмпортеЕГАИС</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеУведомлениеОПланируемомИмпортеЕГАИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтрокаЕГАИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганизацияЕГАИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОрганизацийЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПользователиИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаможенныйПост</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОрганизацийЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаможенныйСклад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОрганизацийЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>АлкогольнаяПродукция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторАлкогольнойПродукцииЕГАИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоЕГАИСНеотрицательное</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоЕГАИСНеотрицательное</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Номенклатура</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СерияНоменклатуры</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусУказанияСерий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Упаковка</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ХарактеристикаНоменклатуры</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторУведомления</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СтрокаЕГАИС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусОбработки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыОбработкиУведомленияОПланируемомИмпортеЕГАИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/CommonModules/ИнтеграцияЕГАИСИСМП/Ext/Module.bsl
// @strict-types

#Область ПрограммныйИнтерфейс

// Доступна работа с кодами маркировки пива.
// 
// Параметры:
//  Отказ - Булево - Отказ от открытия форм связанных с производством/импортом пива
// 
// Возвращаемое значение:
//  Булево - Доступна работа с кодами маркировки ИСМП (пива, слабоалкогольной продукции)
//
Функция ДоступнаРаботаСКодамиМаркировкиИСМП(Отказ = Неопределено) Экспорт
	
	Если Не ОбщегоНазначения.ПодсистемаСуществует("ГосИС.ИСМП") Тогда
		Если Не(Отказ = Неопределено) Тогда
			ОбщегоНазначения.СообщитьПользователю(
				НСтр("ru = 'Для работы с документами производства/импорта пива
					 |требуется встроить подсистему ИС МП библиотеки'"),,,,
				Отказ);
		КонецЕсли;
		Возврат Ложь;
	КонецЕсли;
	
	ВидыПродукции = ДопустимыеВидыПродукцииИмпортаПроизводства();
	
	Если ВидыПродукции.Количество() = 0 Тогда
		Если Не(Отказ = Неопределено) Тогда
			ОбщегоНазначения.СообщитьПользователю(
				НСтр("ru = 'Для работы с документами производства/импорта
					 |требуется включить использование хотя бы одного вида алкогольной продукции
					 |в панели администрирования ИС МП'"),,,,
				Отказ);
		КонецЕсли;
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Допустимые виды продукции, которые можно указать в документе импорта или производства ЕГАИС.
// 
// Параметры:
//  Сырье - Булево - для табличной части Сырья
// 
// Возвращаемое значение:
//  Массив Из ПеречислениеСсылка.ВидыПродукцииИС - Допустимые виды продукции импорта производства
Функция ДопустимыеВидыПродукцииИмпортаПроизводства(Сырье = Ложь) Экспорт
	
	Результат = Новый Массив; //Массив Из ПеречислениеСсылка.ВидыПродукцииИС - 
	
	Если Не ОбщегоНазначения.ПодсистемаСуществует("ГосИС.ИСМП") Тогда
		Возврат Результат;
	КонецЕсли;
	
	Модуль = ОбщегоНазначения.ОбщийМодуль("ИнтеграцияИСМПКлиентСервер");
	Возврат Модуль.ВидыПродукцииЕГАИС(Не Сырье);
	
КонецФункции

// Сформировать данные документа основания.
// 
// Параметры:
//  ТаблицаДанныхДокументаОснования - ТаблицаЗначений - Таблица данных документа основания
//  ДокументОснование - ЛюбаяСсылка - Документ основание
//  ДанныеСформированы - Булево - Данные сформированы
Процедура СформироватьДанныеДокументаОснования(ТаблицаДанныхДокументаОснования, ДокументОснование, ДанныеСформированы) Экспорт
	
	Если ЗначениеЗаполнено(ДокументОснование) Тогда
		Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.УведомлениеОПланируемомИмпортеЕГАИС") Тогда
		
		ДанныеСформированы = Истина;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	УведомлениеОПланируемомИмпортеЕГАИСТовары.Номенклатура                        КАК Номенклатура,
		|	УведомлениеОПланируемомИмпортеЕГАИСТовары.Характеристика                      КАК Характеристика,
		|	УведомлениеОПланируемомИмпортеЕГАИСТовары.Серия                               КАК Серия,
		|	СУММА(УведомлениеОПланируемомИмпортеЕГАИСТовары.Количество)                   КАК Количество
		|ИЗ
		|	Документ.УведомлениеОПланируемомИмпортеЕГАИС.Товары КАК УведомлениеОПланируемомИмпортеЕГАИСТовары
		|ГДЕ
		|	УведомлениеОПланируемомИмпортеЕГАИСТовары.Ссылка = &ДокументСсылка
		|
		|СГРУППИРОВАТЬ ПО
		|	УведомлениеОПланируемомИмпортеЕГАИСТовары.Номенклатура,
		|	УведомлениеОПланируемомИмпортеЕГАИСТовары.Характеристика,
		|	УведомлениеОПланируемомИмпортеЕГАИСТовары.Серия";
		
		Запрос.УстановитьПараметр("ДокументСсылка", ДокументОснование);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			НоваяСтрока = ТаблицаДанныхДокументаОснования.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			
		КонецЦикла;
		
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
